app/views/shopping_list/index.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]
---
    <% @user_recipes.each do |recipe| %>
      <% recipe.recipe_foods.each do |recipe_food| %>