app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @food = Food.find(params[:id])

INSERT INTO "foods" ("name", "measurement_unit", "price", "quatity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Fried"], ["measurement_unit", 1], ["price", "5.0"], ["quatity", 5], ["user_id", 1], ["created_at", "2022-11-17 16:17:16.184704"], ["updated_at", "2022-11-17 16:17:16.184704"]]
---
  def create
    @food = Food.new(food_params[:id])
    # @food.user_id = current_user.id

    respond_to do |format|
      if @food.save

DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 4]]
---
  def destroy
    @food.destroy

SELECT "foods".* FROM "foods" WHERE "foods"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def set_food
    @food = Food.find(params[user])