app/controllers/public_recipes_controller.rb

    def index
      @recipes = Recipe.where(public: true)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]

    def destroy
      @recipe = Recipe.where(public: true).find(params[:id])
      @recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1 AND "recipes"."id" = $2 LIMIT $3  [["public", true], ["id", 3], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 3]]