app/controllers/recipe_foods_controller.rb

  def index
    @recipe_foods = RecipeFood.all
---
SELECT "recipe_foods".* FROM "recipe_foods"

  def new
    @foods = current_user.foods
    @food_items = []
    @foods.each do |food|
      @food_items << [food.name, food.id]
    end
    @recipe = current_user.recipes.find(params[:recipe_id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 3], ["LIMIT", 1]]

  def create
    @recipe = current_user.recipes.find_by(id: params[:recipe_id])
    @recipe_food = @recipe.recipe_foods.new(recipe_food_params)
    @food_items

    if @recipe_food.save
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
INSERT INTO "recipe_foods" ("quantity", "recipe_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", "20"], ["recipe_id", 3], ["food_id", 7], ["created_at", "2022-11-18 16:26:09.910224"], ["updated_at", "2022-11-18 16:26:09.910224"]]

  def destroy
    @recipe_food = RecipeFood.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]