app/controllers/recipe_foods_controller.rb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show;
    @recipe_food = RecipeFood.find_by(id: params[:recipe_id])

INSERT INTO "recipe_foods" ("recipe_id", "food_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["recipe_id", 4], ["food_id", 2], ["quantity", 1], ["created_at", "2023-08-11 07:26:27.694490"], ["updated_at", "2023-08-11 07:26:27.694490"]]
---
  def create
    @recipe_food = RecipeFood.new(recipe_food_params)
    @recipe_food.recipe = @recipe

    respond_to do |format|
      if @recipe_food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def set_recipe_food
    @recipe_food = RecipeFood.find_by(id: params[:recipe_food_id])