app/controllers/shopping_list_controller.rb

  def index
    @user = current_user
    @list = []
    @total_amount = 0

    @user.recipes.each do |recipe|
      recipe.recipe_foods.includes(:food).each do |item|
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 5]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]